/*
 Localization provided by Wordcrafts
 The Mac OS X and iOS localization experts.
 http://www.wordcrafts.de
 */


/* General */

/* For dialogs yes buttons */
"HockeyYes" = "Igen";

/* For dialogs no buttons */
"HockeyNo" = "Nem";

/* For dialogs ok buttons */
"HockeyOK" = "OK";

/* Replacement for app name, if it could not be detected */
"HockeyAppNamePlaceholder" = "Az alkalmazás";

/* Crash */


/* Crash dialog */

/* Title showing in the alert box when crash report data has been found */
"CrashDataFoundTitle" = "%@ váratlanul kilépett";

/* Description explaining that crash data has been found and ask the user if the data might be uploaded to the developers server */
"CrashDataFoundAnonymousDescription" = "Szeretne hibajelentést küldeni, hogy javíthassuk a problémát? A küldés névtelenül történik.";

/* Description explaining that crash data has been found and ask the user if the non anonymous data might be uplaoded to the developers server */
"CrashDataFoundDescription" = "Szeretne hibajelentést küldeni, hogy javíthassuk a problémát?";

/* Alert box button if the users wants to send crash data always automatically */
"CrashSendReportAlways" = "Mindig küldjön";

/* Alert box button to send the crash report once */
"CrashSendReport" = "Jelentés küldése";

/* Alert box button to decline sending the report */
"CrashDontSendReport" = "Ne küldjön";

/* Text showing in a processing box that the crash data is being uploaded to the server */
"CrashReportSending" = "Küldés…";


/* Update */


/* Update Alert view */

/* Update available */
"UpdateAvailable" = "Frissítés elérhető";

"UpdateAlertTextWithAppVersion" = "%@ elérhető.";

"UpdateAlertMandatoryTextWithAppVersion" = "%@ elérhető, és szükséges frissíteni!";

"UpdateIgnore" = "Most nem";

"UpdateShow" = "Megjelenítés";

"UpdateInstall" = "Telepítés";

"UpdateRemindMe" = "Emlékeztessen később";


/* Update Details */

"UpdateScreenTitle" = "Frissítés";

"UpdateButtonCheck" = "ELLENŐRZÉS";

"UpdateButtonSearching" = "KERESÉS";

"UpdateButtonUpdate" = "FRISSÍTÉS";

"UpdateButtonInstalling" = "TELEPÍTÉS";

"UpdateButtonOffline" = "NINCS KAPCSOLAT";

"UpdateInstalled" = "TELEPÍTVE";

"UpdateVersion" = "verzió";

"UpdateShowPreviousVersions" = "Korábbi verziók megtekintése…";

"UpdateNoUpdateAvailableTitle" = "Nincs elérhető frissítés";

"UpdateNoUpdateAvailableMessage" = "%@ már a legfrissebb verzió.";

"UpdateError" = "Hiba";

"UpdateWarning" = "Figyelmeztetés";

"UpdateNoReleaseNotesAvailable" = "Nem elérhető a változások listája.";


/* Update Authorization  */

"UpdateAuthorizationProgress" = "Engedélyezés…";

"UpdateAuthorizationOffline" = "Internetkapcsolat szükséges!";

"UpdateAuthorizationDenied" = "Engedélyezés megtagadva. Lépjen kapcsolatba a fejlesztővel.";


/* Update Expiry  */

"UpdateExpired" = "%@ érvényessége lejárt, és már nem használható.";


/* Update Simulator Warning */

"UpdateSimulatorMessage" = "A Hockey Update nem használható a szimulátorban.\nAz itms-services:// URL séma elérhető, de nem működőképes.";


/* Feedback */


/* New Message Alert */

/* Alert Title */
"HockeyFeedbackNewMessageTitle" = "Új válasz";

/* Alert Text */
"HockeyFeedbackNewMessageText" = "Új válasz érkezett az Ön visszajelzésére. Kívánja most megtekinteni?";

/* Alert Ignore Button */
"HockeyFeedbackIgnore" = "Most nem";

/* Alert Show Button */
"HockeyFeedbackShow" = "Megtekintés";


/* List View */

/* Title */
"HockeyFeedbackListTitle" = "Visszajelzés";

/* Last Updated */
"HockeyFeedbackListLastUpdated" = "Utolsó frissítés: %@";

/* Never Updated */
"HockeyFeedbackListNeverUpdated" = "Soha";

/* Provide Feedback Button Title */
"HockeyFeedbackListButtonWriteFeedback" = "Visszajelzés küldése";

/* Add a Response Button Title */
"HockeyFeedbackListButtonWriteResponse" = "Válasz küldése";

/* User Data Set Name Button Title */
"HockeyFeedbackListButtonUserDataSetName" = "Adja meg a nevét";

/* User Data Set Email Button Title */
"HockeyFeedbackListButtonUserDataSetEmail" = "Adja meg az e-mail címét";

/* User Data With Name Button Title */
"HockeyFeedbackListButtonUserDataWithName" = "Név: %@";

/* User Data With Email Button Title */
"HockeyFeedbackListButtonUserDataWithEmail" = "E-mail: %@";

/* Button title for deleting all local messages*/
"HockeyFeedbackListButtonDeleteAllMessages" = "Összes üzenet törlése";

/* Message pending to be send */
"HockeyFeedbackListMessagePending" = "Folyamatban";


/* Delete All Messages Action Sheet / Alert View */

/* Title for the Action Sheet */
"HockeyFeedbackListDeleteAllTitle" = "Minden üzenet törlődni fog erről az eszközről.";

/* Button Title to perform delete action */
"HockeyFeedbackListDeleteAllDelete" = "Törlés";

/* Button Title to cancel delete action */
"HockeyFeedbackListDeleteAllCancel" = "Mégsem";


/* Open Link In Safari Action Sheet / Alert View */

/* Button Title to cancel */
"HockeyFeedbackListLinkActionCancel" = "Mégsem";

/* Button Title to Open the Link */
"HockeyFeedbackListLinkActionOpen" = "Megnyitás";

/* Button Title to Copy the Link */
"HockeyFeedbackListLinkActionCopy" = "Másolás";


/* UIActivity */

/* Activity Sharing Button Title, App Name will be inserted */
"HockeyFeedbackActivityButtonTitle" = "Visszajelzés: %@";

/* if there can no app name be found, use this instead for HockeyFeedbackActivityButtonTitle */
"HockeyFeedbackActivityAppPlaceholder" = "az alkalmazásról";


/* Compose Message */

/* Title */
"HockeyFeedbackComposeTitle" = "Új visszajelzés";

/* Send button */
"HockeyFeedbackComposeSend" = "Küldés";

/* Add Image button for attachment actions */
"HockeyFeedbackComposeAttachmentAddImage" = "Fotó hozzáadása";

/* Edit button for attachment actions */
"HockeyFeedbackComposeAttachmentEdit" = "Fotó szerkesztése";

/* Delete button for attachment actions */
"HockeyFeedbackComposeAttachmentDelete" = "Fotó törlése";

/* Cancel button for attachment actions */
"HockeyFeedbackComposeAttachmentCancel" = "Mégsem";


/* Set User Data */

/* Title */
"HockeyFeedbackUserDataTitle" = "Felhasználói adatok";

/* Description On What Should Be Entered */
"HockeyFeedbackUserDataDescription" = "Kérjük, adja meg néhány adatát, mielőtt megírja a visszajelzést.";

/* Name Field */
"HockeyFeedbackUserDataName" = "Név";

/* Name Placeholder */
"HockeyFeedbackUserDataNamePlaceHolder" = "Gipsz Jakab";

/* Email Field */
"HockeyFeedbackUserDataEmail" = "E-mail";

/* Email Placeholder */
"HockeyFeedbackUserDataEmailPlaceholder" = "email@example.com";


/* Authenticator */

/* View Controller Title*/
"HockeyAuthenticatorViewControllerTitle" = "HockeyApp";

/* BITAuthenticatorAuthTypeUDIDProvider */
"HockeyAuthenticationViewControllerWebUDIDLoginDescription" = "A fejlesztő szeretné hozzáférni készüléke UDID azonosítójához. Kattintással nyissa meg a HockeyApp weblapot és engedélyezze a hozzáférést.";
"HockeyAuthenticationViewControllerWebLoginButtonTitle" = "HockeyApp megnyitása";

/* BITAuthenticatorIdentificationTypeWebAuth */
"HockeyAuthenticationViewControllerWebAuthLoginDescription" = "A fejlesztő szeretné hozzáférni a HockeyApp fiókjának e-mail címéhez. Kattintással nyissa meg a HockeyApp weblapot és engedélyezze a hozzáférést.";

/* BITAuthenticatorAuthTypeEmail and BITAuthenticatorAuthTypeEmailAndPassword */
"HockeyAuthenticationViewControllerDataEmailAndPasswordDescription" = "Kérjük, adja meg HockeyApp fiókjához tartozó e-mail címét és jelszavát az alkalmazáshoz történő hozzáférés engedélyezéséhez.";
"HockeyAuthenticationViewControllerDataEmailDescription" = "Kérjük, adja meg HockeyApp fiókjához tartozó e-mail címét az alkalmazáshoz történő hozzáférés engedélyezéséhez.";
"HockeyAuthenticationViewControllerEmailPlaceholder" = "email@example.com";
"HockeyAuthenticationViewControllerPasswordPlaceholder" = "Szükséges mező";
"HockeyAuthenticationViewControllerEmailDescription" = "E-mail";
"HockeyAuthenticationViewControllerPasswordDescription" = "Jelszó";

/* Error presented to the user if authentication failed because of networking issues */
"HockeyAuthenticationViewControllerNetworkError" = "A hitelesítés sikertelen, mert készüléke nem csatlakozik az internethez. Kérjük, próbálja meg később újra.";

"HockeyAuthenticationFailedAuthenticate" = "A hitelesítés sikertelen. Kérjük, próbálja meg később újra vagy lépjen kapcsolatba az alkalmazás fejlesztőjével.";
"HockeyAuthenticationNotMember" = "Nem jogosult az alkalmazás használatára. Kérjük, lépjen kapcsolatba az alkalmazás fejlesztőjével.";
"HockeyAuthenticationContactDeveloper" = "Hitelesítési hiba. Kérjük, lépjen kapcsolatba az alkalmazás fejlesztőjével.";
"HockeyAuthenticationWrongEmailPassword" = "Érvénytelen e-mail címet vagy jelszót adott meg. Kérjük, ellenőrizze a bevitelt és adja meg az adatokat újra.";
"HockeyAuthenticationAuthSecretMissing" = "A HockeySDK \"authorization secret\" még nincs beállítva. Kérjük, lépjen kapcsolatba az alkalmazás fejlesztőjével.";

/* Accessibility strings */
"HockeyAccessibilityHintRequired" = "Szükséges mező";
